Revit 2027 API
WireTypeSet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual WireTypeSetIterator ReverseIterator()
Public Overridable Function ReverseIterator As WireTypeSetIterator
public:
virtual WireTypeSetIterator^ ReverseIterator()
abstract ReverseIterator : unit -> WireTypeSetIterator
override ReverseIterator : unit -> WireTypeSetIterator
Return Value
WireTypeSetIterator
Returns a backward moving iterator to the set.
See Also
Reference
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace